package com.assist.server
{

    public class FameLevel extends Object
    {
        public static const Levels:Object = {1:[0, "无"], 2:[1, "初阶斗者"], 3:[2, "中阶斗者"], 4:[3, "高阶斗者"], 5:[4, "顶阶斗者"], 6:[5, "初阶斗师"], 7:[6, "中阶斗师"], 8:[7, "高阶斗师"], 9:[8, "顶阶斗师"], 10:[9, "初阶大斗师"], 11:[10, "中阶大斗师"], 12:[11, "高阶大斗师"], 13:[12, "顶阶大斗师"], 14:[13, "初级斗灵"], 15:[14, "中级斗灵"], 16:[15, "高级斗灵"], 17:[16, "顶级斗灵"], 18:[17, "初阶斗王"], 19:[18, "中阶斗王"], 20:[19, "高阶斗王"], 21:[20, "顶阶斗王"], 22:[21, "初级斗皇"], 23:[22, "中级斗皇"], 24:[23, "高级斗皇"], 25:[24, "顶级斗皇"], 26:[25, "初阶斗宗"], 27:[26, "中阶斗宗"], 28:[27, "高阶斗宗"], 29:[28, "顶阶斗宗"], 30:[29, "初阶斗尊"], 31:[30, "中阶斗尊"], 32:[31, "高阶斗尊"], 33:[32, "顶阶斗尊"], 34:[33, "初阶斗圣"], 35:[34, "中阶斗圣"], 36:[35, "高阶斗圣"], 37:[36, "顶阶斗圣"], 38:[37, "初阶斗帝"], 39:[38, "中阶斗帝"], 40:[39, "高阶斗帝"], 41:[40, "顶阶斗帝"], 42:[41, "神仙"]};
        public static const roleLevels:Object = {1:0, 2:10, 3:100, 4:1000, 5:5000, 6:20000, 7:50000, 8:60000, 9:100000, 10:150000, 11:200000, 12:260000, 13:330000, 14:400000, 15:480000, 16:560000, 17:640000, 18:700000, 19:800000, 20:1000000, 21:1200000, 22:1300000, 23:1600000, 24:1700000, 25:1800000, 26:2000000};

        public function FameLevel()
        {
            return;
        }// end function

        public static function getFameName(param1:int) : String
        {
            var _loc_2:Array = null;
            for each (_loc_2 in Levels)
            {
                
                if (_loc_2[0] == param1)
                {
                    return _loc_2[1];
                }
            }
            return "";
        }// end function

        public static function getFameExpForFameLevel(param1:int) : int
        {
            return roleLevels[param1] || 0;
        }// end function

    }
}
