package com.assist.server.source
{

    public class NineRegionsTypeData extends Object
    {
        public static const NineRegions:Array = [[1, "厚土界", 101, "神农精魄", 1, 2000, 4000, 6000, 8000], [2, "元木界", 111, "黄帝精魄", 2, 500, 1000, 2000, 3000], [3, "朔金界", 121, "伏羲精魄", 6, 500, 1000, 2000, 3000], [4, "蜃沙界", 131, "女娲精魄", 11, 3, 6, 9, 12], [5, "虚风界", 141, "火神精魄", 9, 3, 6, 9, 12], [6, "震雷界", 151, "盘古精魄", 4, 500, 1000, 2000, 3000], [7, "离火界", 161, "黄帝精魄二阶", 10, 3, 6, 9, 12], [8, "柔水界", 171, "神农精魄二阶", 13, 3, 6, 9, 12], [9, "空明界", 181, "伏羲精魄二阶", 8, 3, 6, 9, 12]];
        public static const NineRegionsMonster:Array = [[1, 1, 2511, "LuoChaJianShen", "罗刹剑神", 0, 200, 1000000, "队长，想挑战我，就点一下我吧！|赶紧叫人吧，都不够3个人啊！|哈哈哈，想杀我，没那么容易的！"], [1, 2, 2512, "ShiPo", "湿婆", 0, 200, 1000000, "队长，想挑战我，就点一下我吧！|赶紧叫人吧，都不够3个人啊！|哈哈哈，想杀我，没那么容易的！"], [1, 3, 2513, "BaoNuShiPo", "暴怒湿婆", 0, 200, 1000000, "队长，想挑战我，就点一下我吧！|赶紧叫人吧，都不够3个人啊！|哈哈哈，想杀我，没那么容易的！"], [2, 1, 2514, "LuoChaDaoSheng", "罗刹刀圣", 0, 200, 1000000, "队长，想挑战我，就点一下我吧！|赶紧叫人吧，都不够3个人啊！|哈哈哈，想杀我，没那么容易的！"], [2, 2, 2515, "FanTian", "梵天", 0, 200, 1000000, "队长，想挑战我，就点一下我吧！|赶紧叫人吧，都不够3个人啊！|哈哈哈，想杀我，没那么容易的！"], [2, 3, 2516, "BaoNuFanTian", "暴怒梵天", 0, 200, 1000000, "队长，想挑战我，就点一下我吧！|赶紧叫人吧，都不够3个人啊！|哈哈哈，想杀我，没那么容易的！"], [3, 1, 2593, "BingLuoHou", "魔睺冰兽", 0, 200, 1000000, "队长，想挑战我，就点一下我吧！|赶紧叫人吧，都不够3个人啊！|哈哈哈，想杀我，没那么容易的！"], [3, 2, 2594, "PiShiNu", "毗湿奴", 0, 200, 1000000, "队长，想挑战我，就点一下我吧！|赶紧叫人吧，都不够3个人啊！|哈哈哈，想杀我，没那么容易的！"], [3, 3, 2595, "BaoNuPiShiNu", "暴怒毗湿奴", 0, 200, 1000000, "队长，想挑战我，就点一下我吧！|赶紧叫人吧，都不够3个人啊！|哈哈哈，想杀我，没那么容易的！"], [4, 1, 2596, "GuangMuTianWang", "广目天王", 0, 200, 1000000, "队长，想挑战我，就点一下我吧！|赶紧叫人吧，都不够3个人啊！|哈哈哈，想杀我，没那么容易的！"], [4, 2, 2597, "JiaLouLuo", "迦楼罗", 0, 200, 1000000, "队长，想挑战我，就点一下我吧！|赶紧叫人吧，都不够3个人啊！|哈哈哈，想杀我，没那么容易的！"], [4, 3, 2598, "BaoNuJiaLouLuo", "暴怒迦楼罗", 0, 200, 1000000, "队长，想挑战我，就点一下我吧！|赶紧叫人吧，都不够3个人啊！|哈哈哈，想杀我，没那么容易的！"], [5, 1, 2599, "LieXiuLuoZhanShi", "烈炎修罗", 0, 200, 1000000, "队长，想挑战我，就点一下我吧！|赶紧叫人吧，都不够3个人啊！|哈哈哈，想杀我，没那么容易的！"], [5, 2, 2600, "AXiuLuo", "阿修罗", 0, 200, 1000000, "队长，想挑战我，就点一下我吧！|赶紧叫人吧，都不够3个人啊！|哈哈哈，想杀我，没那么容易的！"], [5, 3, 2601, "BaoNuAXiuLuo", "暴怒阿修罗", 0, 200, 1000000, "队长，想挑战我，就点一下我吧！|赶紧叫人吧，都不够3个人啊！|哈哈哈，想杀我，没那么容易的！"], [6, 1, 2620, "GuiMian", "鬼才", 0, 200, 1000000, "队长，想挑战我，就点一下我吧！|赶紧叫人吧，都不够3个人啊！|哈哈哈，想杀我，没那么容易的！"], [6, 2, 2621, "SuMo", "苏摩", 0, 200, 1000000, "队长，想挑战我，就点一下我吧！|赶紧叫人吧，都不够3个人啊！|哈哈哈，想杀我，没那么容易的！"], [6, 3, 2622, "BaoNuSuMo", "暴怒苏摩", 0, 200, 1000000, "队长，想挑战我，就点一下我吧！|赶紧叫人吧，都不够3个人啊！|哈哈哈，想杀我，没那么容易的！"]];
        public static const HiddenLevel:Array = [[1, "朔金界神秘层", 1000, 1000, "5回合内未击败所有怪物则挑战失败；挑战成功可获得1000声望、1000武魂。"], [2, "蜃沙界神秘层", 1000, 1000, "一定回合内未击败所有怪物，死去的怪物将复活；挑战成功可获得1000声望、1000武魂。"]];

        public function NineRegionsTypeData()
        {
            return;
        }// end function

    }
}
